fun main() {
    val publishedAgo: Int = (0..100).random()
    println("Запись опубликована ${publishedAgoToTimeInWords(publishedAgo)} (${publishedAgo}c назад)")
}

fun publishedAgoToTimeInWords(publishedAgo: Int): String = when (publishedAgo) {
    in 0..30 -> "менее минуты назад"
    in 31..90 -> "минуту назад"
    in 91..360 -> "6 минут назад"
    in 361..3600 -> "час назад"
    in 3601..7200 -> "2 часа назад"
    in 7201..86_400 -> "несколько часов назад"
    in 86_401..172_800 -> "день назад"
    in 172_801..604_800 -> "несколько дней назад"
    in 604_801..1_209_600 -> "неделю назад"
    in 1_209_601..2_678_400 -> "несколько недель назад"
    in 2_678_401..5_356_800 -> "месяц назад"
    in 5_356_801..32_140_800 -> "несколько месяцев назад"
    in 32_140_801..64_281_600 -> "год назад"
    else -> "несколько лет назад"
}